<?php

echo 'Hello, World!';
echo '</br>';

// 1. Створіть змінні $ a = 10 і $ b = 2. Виведіть на екран їх суму, різницю, добуток і частку (результат ділення).
// 2. Створіть змінні $ c = 15 і $ d = 2. Підсумуйте їх, а результат надайте змінної $ result. Виведіть на екран значення змінної $ result
// 3. Створіть масив $ arr = array ('html', 'css', 'php') і з його допомогою виведіть на екран рядок 'php, html, css'.
// 4. Дано масив з елементами 'html', 'css', 'php', 'js', 'jq'. За допомогою циклу foreach виведіть ці слова в стовпчик.
$a = 10;
$b = 2;
echo $a + $b;
echo '</br>';
echo $a - $b;
echo '</br>';
echo $a * $b;
echo '</br>';
echo $a / $b;
echo '</br>';
$c = 15;
$d = 2;
$result = $c + $d;

echo $result;
echo '</br>';
echo '</br>';

$arr = array('html', 'css', 'php');
echo $arr[2];
echo '</br>';
echo $arr[0];
echo '</br>';
echo $arr[1];
echo '</br>';
echo '</br>';

$arr2 = array('html', 'css', 'php', 'js', 'jq');
foreach ($arr2 as $element) {

    echo $element;
    echo '</br>';
}
echo '</br>';



// Написати цикл while, який буде виводити на екран всі непарні числа від 0 до 50.
// Дан масив з елементами 2, 5, 9, 15, 0, 4. За допомогою циклу foreach і оператора if виведіть на екран стовпець тих елементів масиву, які більше 3-х, але менше 10.
// Створити функцію, яка приймає чотири текстові рядки у вигляді вхідних змінних, а виводить html-код таблиці, де кожний з вихідних рядків розташований в окремій клітинці таблиці.


// Написати цикл while, який буде виводити на екран всі непарні числа від 0 до 50.
print '<p>Написати цикл while, який буде виводити на екран всі непарні числа від 0 до 50.
</p>';
$i = 0;
while ($i <= 50) {
    if ($i % 2 != 0) {
        echo $i;
        echo '</br>';
    }
    $i++;
}
echo '</br>';

print '<p>Дан масив з елементами 2, 5, 9, 15, 0, 4. За допомогою циклу foreach і оператора if виведіть на екран стовпець тих елементів масиву, які більше 3-х, але менше 10.
</p>';
$arr3 = array(2, 5, 9, 15, 0, 4);
foreach ($arr3 as $element) {
    if ($element > 3 && $element < 10) {
        echo $element;
        echo '</br>';
    }
}

print '<p>Створити функцію, яка приймає чотири текстові рядки у вигляді вхідних змінних, а виводить html-код таблиці, де кожний з вихідних рядків розташований в окремій клітинці таблиці.
</p>';
createTable('a', 'b', 'c', 'd');
function createTable(...$string)
{
    print '<table>';


    foreach ($string as $stringElement) {
        print '<tr>
    <td>
    ' . $stringElement . '
    </td>
    
    
        </tr>';
    }
    print '</table>';
}
