<?php
// Завдання 3: Багатосторінковий тест
// Уявімо собі сайт з проходженням тесту: на кожній сторінці знаходиться питання, варіанти відповіді і кнопка "Далі". Тест містить деяку кількість сторінок (беремо 2). На останній, 3-й сторінці користувач повинен отримати результат тесту.
// Завдання - створити подібний тест.
// Підказки для студентів:
// • Для створення сторінок питань використовуйте форми (з елементами type = "radio"), які будуть відправляти результати на наступну сторінку з питанням або результатами.
// • Відповіді користувача на питання на попередніх сторінках можна (і потрібно) зберігати в сесії php
// • Для розрахунку результатів тесту порівняйте відповіді користувача (зберігаються в сесії php) із заздалегідь визначеними правильними відповідями (можуть зберігатися, наприклад, в змінних).
// • Після закінчення тесту сесію слід очистити


